external/Внешние/src/ExternalDataProcessors/СоздатьЛистыКассовойКниги/СоздатьЛистыКассовойКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>СоздатьЛистыКассовойКниги</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

external/Внешние/src/ExternalDataProcessors/СоздатьЛистыКассовойКниги/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура;
	Если Год(Объект.НачалоПериода) <> Год(Объект.КонецПериода) Тогда
		// Установлен расширенный налоговый период, но форма ВыборСтандартногоПериода предназначена
		// только для выбора периода в пределах года. Поэтому в качестве начала периода используем
		// минимально возможную дату.
		ПараметрыВыбора.Вставить("НачалоПериода", НачалоГода(Объект.КонецПериода));
	Иначе
		ПараметрыВыбора.Вставить("НачалоПериода", Объект.НачалоПериода);
	КонецЕсли;
	ПараметрыВыбора.Вставить("КонецПериода",  Объект.КонецПериода);
	//ПараметрыВыбора.Вставить("Кратность", ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериода = РезультатВыбора.НачалоПериода;
	Объект.КонецПериода = РезультатВыбора.КонецПериода;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомераЛистов(ДокЛистКК)
	
	Если ДокЛистКК.КассовыеОрдера.Количество() > 0 Тогда
	
		ТекстЗапроса = " 
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассоваяКнигаДокументы.НомерЛиста КАК НомерЛиста,
		|	ДанныеДокумента.Дата КАК Период
		|ИЗ
		|	Документ.ЛистКассовойКниги КАК ДанныеДокумента
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ.ЛистКассовойКниги.КассовыеОрдера КАК КассоваяКнигаДокументы
		|	ПО
		|		ДанныеДокумента.Ссылка = КассоваяКнигаДокументы.Ссылка
		|ГДЕ
		|	ДанныеДокумента.Организация = &Организация
		|	И ДанныеДокумента.КассоваяКнига = &КассоваяКнига
		|	И ДанныеДокумента.Проведен
		|	И КассоваяКнигаДокументы.НомерЛиста <> 0
		|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|	И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ГОД) = НАЧАЛОПЕРИОДА(&Дата, ГОД)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ,
		|	НомерЛиста УБЫВ
		|";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Организация", ДокЛистКК.Организация);
		Запрос.УстановитьПараметр("КассоваяКнига", ДокЛистКК.КассоваяКнига);
		Запрос.УстановитьПараметр("Дата", ДокЛистКК.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПоследнийНомер = Выборка.НомерЛиста;
		Иначе
			ПоследнийНомер = 0;
		КонецЕсли;
		
		НачальныйНомерЛиста = ПоследнийНомер + 1;
		ТекущийНомерЛиста = ПоследнийНомер + 1;
		
		Сч = 0;
		Для Каждого СтрокаТаблицы Из ДокЛистКК.КассовыеОрдера Цикл
			
			Если СтрокаТаблицы.НомерЛиста <> ТекущийНомерЛиста Тогда
				СтрокаТаблицы.НомерЛиста = ТекущийНомерЛиста;
			КонецЕсли;
			
			КонечныйНомерЛиста = ТекущийНомерЛиста;
			
			Сч = Сч + 1;
			Если Сч >= ДокЛистКК.КоличествоДокументовНаЛисте Тогда
				Сч = 0;
				ТекущийНомерЛиста = ТекущийНомерЛиста + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НачальныйНомерЛиста = КонечныйНомерЛиста Тогда
			ТекущиеНомераЛистов = НачальныйНомерЛиста;
		Иначе
			ТекущиеНомераЛистов = Строка(НачальныйНомерЛиста) + "-" + Строка(КонечныйНомерЛиста); 
		КонецЕсли;
		
	Иначе
		ТекущиеНомераЛистов = "";
	КонецЕсли;
		
	Если ДокЛистКК.НомераЛистов <> ТекущиеНомераЛистов Тогда
		ДокЛистКК.НомераЛистов = ТекущиеНомераЛистов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	ТекДата = НачалоДня(Объект.НачалоПериода);
	Пока ТекДата <= Объект.КонецПериода Цикл
		
//
		//ТекстЗапроса = "
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ДенежныеСредства.Регистратор КАК Документ,
		//|	ВЫБОР
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		//|	КОНЕЦ КАК НомерДокумента,
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ КАК ЗначениеУпорядочивания,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Приход,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Расход,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
		//|	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		//|ИЗ
		//|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Документ.ЛистКассовойКниги.КассовыеОрдера КАК ДокументКассоваяКнига
		//|	ПО
		//|		ДокументКассоваяКнига.Ссылка.Проведен
		//|		И ДокументКассоваяКнига.Ссылка.Организация = &Организация
		//|		И ДокументКассоваяКнига.Ссылка.КассоваяКнига = &КассоваяКнига
		//|		И ДокументКассоваяКнига.Документ = ДенежныеСредства.Регистратор
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		//|	ПО
		//|		СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств
		//|
		//|ГДЕ
		//|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|	И ДенежныеСредства.Организация = &Организация
		//|	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		//|	И ДокументКассоваяКнига.Документ ЕСТЬ NULL
		//|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		//|	И НЕ ДенежныеСредства.ХозяйственнаяОперация В
		//|		(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеИзлишкаПриИнвентаризацииДенежныхСредств),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеНедостачиПриИнвентаризацииДенежныхСредств))
		//|	
		//|СГРУППИРОВАТЬ ПО
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		//|	ДенежныеСредства.Регистратор
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ДенежныеСредства.Регистратор КАК Документ,
		//|	ВЫБОР
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		//|	КОНЕЦ КАК НомерДокумента,
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ КАК ЗначениеУпорядочивания,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Приход,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Расход,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
		//|	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		//|ИЗ
		//|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Документ.ЛистКассовойКниги.КассовыеОрдера КАК ДокументКассоваяКнига
		//|	ПО
		//|		ДокументКассоваяКнига.Ссылка.Проведен
		//|		И ДокументКассоваяКнига.Ссылка.Организация = &Организация
		//|		И ДокументКассоваяКнига.Ссылка.КассоваяКнига = &КассоваяКнига
		//|		И ДокументКассоваяКнига.Документ = ДенежныеСредства.Регистратор
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		//|	ПО
		//|		СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств
		//|
		//|ГДЕ
		//|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|	И ДенежныеСредства.Организация = &Организация
		//|	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		//|	И ДокументКассоваяКнига.Документ ЕСТЬ NULL
		//|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		//|	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
		//|	И (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).КассаОтправитель КАК Справочник.Кассы).КассоваяКнига <> &КассоваяКнига
		//|		ИЛИ ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).КассаОтправитель) = ТИП(Справочник.КассыККМ))
		//|	
		//|СГРУППИРОВАТЬ ПО
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		//|	ДенежныеСредства.Регистратор
		//|
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ДенежныеСредства.Регистратор КАК Документ,
		//|	ВЫБОР
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		//|	КОНЕЦ КАК НомерДокумента,
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ КАК ЗначениеУпорядочивания,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Приход,
		//|	СУММА(
		//|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|			ДенежныеСредства.Сумма
		//|		ИНАЧЕ
		//|			0
		//|		КОНЕЦ
		//|	) КАК Расход,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
		//|	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		//|ИЗ
		//|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Документ.ЛистКассовойКниги.КассовыеОрдера КАК ДокументКассоваяКнига
		//|	ПО
		//|		ДокументКассоваяКнига.Ссылка.Проведен
		//|		И ДокументКассоваяКнига.Ссылка.Организация = &Организация
		//|		И ДокументКассоваяКнига.Ссылка.КассоваяКнига = &КассоваяКнига
		//|		И ДокументКассоваяКнига.Документ = ДенежныеСредства.Регистратор
		//|
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		//|	ПО
		//|		СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств
		//|
		//|ГДЕ
		//|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|	И ДенежныеСредства.Организация = &Организация
		//|	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		//|	И ДокументКассоваяКнига.Документ ЕСТЬ NULL
		//|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		//|	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
		//|	И (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).КассаПолучатель КАК Справочник.Кассы).КассоваяКнига <> &КассоваяКнига
		//|		ИЛИ ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).КассаПолучатель) = ТИП(Справочник.КассыККМ))
		//|	
		//|СГРУППИРОВАТЬ ПО
		//|	ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|		0
		//|	КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|		1
		//|	КОНЕЦ,
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		//|	ДенежныеСредства.Регистратор
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|	
		//|ВЫБРАТЬ
		//|	НЕОПРЕДЕЛЕНО КАК Документ,
		//|	"""" КАК НомерДокумента,
		//|	2 КАК ЗначениеУпорядочивания,
		//|	ВЫБОР КОГДА
		//|		СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|					ДенежныеСредства.СуммаРегл
		//|				КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|					-ДенежныеСредства.СуммаРегл
		//|				КОНЕЦ) > 0 ТОГДА
		//|		СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|					ДенежныеСредства.СуммаРегл
		//|				КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|					-ДенежныеСредства.СуммаРегл
		//|				КОНЕЦ)
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК Приход,
		//|	ВЫБОР КОГДА
		//|		СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|					ДенежныеСредства.СуммаРегл
		//|				КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|					-ДенежныеСредства.СуммаРегл
		//|				КОНЕЦ) < 0 ТОГДА
		//|		-СУММА(ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
		//|					ДенежныеСредства.СуммаРегл
		//|				КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА
		//|					-ДенежныеСредства.СуммаРегл
		//|				КОНЕЦ)
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК Расход,
		//|	&ВалютаРегламентированногоУчета КАК Валюта,
		//|	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		//|ИЗ
		//|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		//|	
		//|	ЛЕВОЕ СОЕДИНЕНИЕ
		//|		Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		//|	ПО
		//|		СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств
		//|	
		//|ГДЕ
		//|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|	И ДенежныеСредства.СуммаРегл <> 0
		//|	И ДенежныеСредства.Организация = &Организация
		//|	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		//|	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		//|	И ДенежныеСредства.ХозяйственнаяОперация В (
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль),
		//|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток))
		//|	
		//|СГРУППИРОВАТЬ ПО
		//|	ДенежныеСредства.Касса.ВалютаДенежныхСредств
		//|	
		//|УПОРЯДОЧИТЬ ПО
		//|	ЗначениеУпорядочивания,
		//|	ВЫБОР
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		//|		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
		//|			ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		//|	КОНЕЦ ВОЗР
		//|";
		//
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДенежныеСредства.Регистратор КАК Документ,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		               |	КОНЕЦ КАК НомерДокумента,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ КАК ЗначениеУпорядочивания,
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Приход,
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Расход,
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
		               |	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет) КАК КорреспондирующийСчет
		               |ИЗ
		               |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		               |		ПО (СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств)
		               |ГДЕ
		               |	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |	И ДенежныеСредства.Организация = &Организация
		               |	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		               |	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		               |	И НЕ ДенежныеСредства.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеИзлишкаПриИнвентаризацииДенежныхСредств), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтражениеНедостачиПриИнвентаризацииДенежныхСредств))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ,
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		               |	ДенежныеСредства.Регистратор
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДенежныеСредства.Регистратор,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ,
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ),
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ),
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		               |	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет)
		               |ИЗ
		               |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		               |		ПО (СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств)
		               |ГДЕ
		               |	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |	И ДенежныеСредства.Организация = &Организация
		               |	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		               |	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		               |	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы)
		               |	И (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).КассаОтправитель КАК Справочник.Кассы).КассоваяКнига <> &КассоваяКнига
		               |			ИЛИ ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).КассаОтправитель) = ТИП(Справочник.КассыККМ))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ,
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		               |	ДенежныеСредства.Регистратор
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДенежныеСредства.Регистратор,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ,
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ),
		               |	СУММА(ВЫБОР
		               |			КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |				ТОГДА ДенежныеСредства.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ),
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		               |	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет)
		               |ИЗ
		               |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		               |		ПО (СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств)
		               |ГДЕ
		               |	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |	И ДенежныеСредства.Организация = &Организация
		               |	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		               |	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		               |	И ДенежныеСредства.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
		               |	И (ВЫРАЗИТЬ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).КассаПолучатель КАК Справочник.Кассы).КассоваяКнига <> &КассоваяКнига
		               |			ИЛИ ТИПЗНАЧЕНИЯ(ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).КассаПолучатель) = ТИП(Справочник.КассыККМ))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |			ТОГДА 0
		               |		КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |			ТОГДА 1
		               |	КОНЕЦ,
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств,
		               |	ДенежныеСредства.Регистратор
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	НЕОПРЕДЕЛЕНО,
		               |	"""",
		               |	2,
		               |	ВЫБОР
		               |		КОГДА СУММА(ВЫБОР
		               |					КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |						ТОГДА ДенежныеСредства.СуммаРегл
		               |					КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |						ТОГДА -ДенежныеСредства.СуммаРегл
		               |				КОНЕЦ) > 0
		               |			ТОГДА СУММА(ВЫБОР
		               |						КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |							ТОГДА ДенежныеСредства.СуммаРегл
		               |						КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |							ТОГДА -ДенежныеСредства.СуммаРегл
		               |					КОНЕЦ)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА СУММА(ВЫБОР
		               |					КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |						ТОГДА ДенежныеСредства.СуммаРегл
		               |					КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |						ТОГДА -ДенежныеСредства.СуммаРегл
		               |				КОНЕЦ) < 0
		               |			ТОГДА -СУММА(ВЫБОР
		               |						КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		               |							ТОГДА ДенежныеСредства.СуммаРегл
		               |						КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		               |							ТОГДА -ДенежныеСредства.СуммаРегл
		               |					КОНЕЦ)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ,
		               |	&ВалютаРегламентированногоУчета,
		               |	МАКСИМУМ(СтатьиДДС.КорреспондирующийСчет)
		               |ИЗ
		               |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДДС
		               |		ПО (СтатьиДДС.Ссылка = ДенежныеСредства.СтатьяДвиженияДенежныхСредств)
		               |ГДЕ
		               |	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		               |	И ДенежныеСредства.СуммаРегл <> 0
		               |	И ДенежныеСредства.Организация = &Организация
		               |	И ДенежныеСредства.Касса.КассоваяКнига = &КассоваяКнига
		               |	И НЕ ДенежныеСредства.Регистратор ССЫЛКА Документ.ВводОстатков
		               |	И ДенежныеСредства.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСПрибыль), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КурсовыеРазницыДСУбыток))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДенежныеСредства.Касса.ВалютаДенежныхСредств
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЗначениеУпорядочивания,
		               |	ВЫБОР
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
		               |		КОГДА ДенежныеСредства.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		               |			ТОГДА ВЫРАЗИТЬ(ДенежныеСредства.Регистратор КАК Документ.РасходныйКассовыйОрдер).Номер
		               |	КОНЕЦ";
		
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекДата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекДата));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("КассоваяКнига", Справочники.КассовыеКниги.ПустаяСсылка());
		Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
		Иначе
			
			ЗапросКонМесяца = Новый Запрос;
			ЗапросКонМесяца.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                        |	ДенежныеСредстваНаличные.Период КАК Период,
			                        |	ДенежныеСредстваНаличные.Регистратор.Дата КАК РегистраторДата
			                        |ИЗ
			                        |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредстваНаличные
			                        |ГДЕ
			                        |	ДенежныеСредстваНаличные.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
			                        |
			                        |УПОРЯДОЧИТЬ ПО
			                        |	РегистраторДата УБЫВ";
			
			ЗапросКонМесяца.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекДата));	
			ЗапросКонМесяца.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекДата));
			ВыборкаКонМесяца = ЗапросКонМесяца.Выполнить().Выбрать();
			ДатаКассаКонМесяца = Дата(1,1,1);
			Если ВыборкаКонМесяца.Следующий() Тогда
				ДатаКассаКонМесяца = ВыборкаКонМесяца.РегистраторДата;	
			КонецЕсли;	
			
			ЗапросКонГода = Новый Запрос;
			ЗапросКонГода.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			                        |	ДенежныеСредстваНаличные.Период КАК Период,
			                        |	ДенежныеСредстваНаличные.Регистратор.Дата КАК РегистраторДата
			                        |ИЗ
			                        |	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредстваНаличные
			                        |ГДЕ
			                        |	ДенежныеСредстваНаличные.Период МЕЖДУ &НачалоГода И &КонецГода
			                        |
			                        |УПОРЯДОЧИТЬ ПО
			                        |	РегистраторДата УБЫВ";
			
			ЗапросКонГода.УстановитьПараметр("НачалоГода", НачалоГода(ТекДата));	
			ЗапросКонГода.УстановитьПараметр("КонецГода", КонецГода(ТекДата));
			ВыборкаКонГода = ЗапросКонГода.Выполнить().Выбрать();
			ДатаКассаКонГода = Дата(1,1,1);
			Если ВыборкаКонГода.Следующий() Тогда
				ДатаКассаКонГода = ВыборкаКонГода.РегистраторДата;	
			КонецЕсли;	
			
			
			ТекстЗапросаЛистКК = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДокументКассоваяКнига.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЛистКассовойКниги КАК ДокументКассоваяКнига
			|ГДЕ
			|	ДокументКассоваяКнига.Организация = &Организация
			|	И ДокументКассоваяКнига.Проведен
			|	И НАЧАЛОПЕРИОДА(ДокументКассоваяКнига.Дата, ДЕНЬ) = &ДатаНач";
			
			ЗапросЛистКК = Новый Запрос(ТекстЗапросаЛистКК);
			ЗапросЛистКК.УстановитьПараметр("Организация", Объект.Организация);
			ЗапросЛистКК.УстановитьПараметр("ДатаНач", НачалоДня(ТекДата));
			
			РезультатЛистКК = ЗапросЛистКК.Выполнить();
			Если РезультатЛистКК.Пустой() Тогда
				ОбЛистКК = Документы.ЛистКассовойКниги.СоздатьДокумент();
				ОбЛистКК.Дата = КонецДня(ТекДата);
				ОбЛистКК.Организация = Объект.Организация;
				ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОбЛистКК);
			Иначе
				ВыборкаЛистКК = РезультатЛистКК.Выбрать();
				Пока ВыборкаЛистКК.Следующий() Цикл
					ОбЛистКК = ВыборкаЛистКК.Ссылка.ПолучитьОбъект();			
					ОбЛистКК.КассовыеОрдера.Очистить();
				КонецЦикла;
			КонецЕсли;
			
			ОбЛистКК.ТипЛиста    = Перечисления.ТипыЛистовКассовойКниги.Обычный;
			Если ДатаКассаКонМесяца <> Дата(1,1,1) Тогда
				Если КонецДня(ДатаКассаКонМесяца) = КонецДня(ТекДата) Тогда
					ОбЛистКК.ТипЛиста    = Перечисления.ТипыЛистовКассовойКниги.ПоследнийВМесяце;
				КонецЕсли;
			КонецЕсли;	
			Если ДатаКассаКонГода <> Дата(1,1,1) Тогда
				Если КонецДня(ДатаКассаКонГода) = КонецДня(ТекДата) Тогда
					ОбЛистКК.ТипЛиста    = Перечисления.ТипыЛистовКассовойКниги.ПоследнийВГоду;
				КонецЕсли;
			КонецЕсли;
			ОбЛистКК.КоличествоДокументовНаЛисте = 20;
			
			ОбЛистКК.КассовыеОрдера.Загрузить(РезультатЗапроса.Выгрузить());
			ОбЛистКК.Записать(РежимЗаписиДокумента.Запись);
			ЗаполнитьНомераЛистов(ОбЛистКК);
			ОбЛистКК.Записать(РежимЗаписиДокумента.Запись);
			Попытка
				ОбЛистКК.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
		КонецЕсли;

		ТекДата = ТекДата + 24*60*60;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СформироватьДокументы(Команда)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение("Не выбрана организация");
		Возврат;
	КонецЕсли;
	СформироватьДокументыНаСервере();
	Сообщить("Обработка закончена");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.НачалоПериода = НачалоДня(ТекущаяДата());
	Объект.КонецПериода  = КонецДня(ТекущаяДата());
КонецПроцедуры
